[{"radar": "microsoft", "quadrant": 4, "ring": "einsetzen", "name": "CAML", "kommentare": null, "desc": "CAML (Collaborative Application Markup Language) ist eine auf XML basierende Auszeichnungssprache, die speziell für die SharePoint-Produkte (z. B. Microsoft SharePoint Foundation und Microsoft SharePoint Server) entwickelt wurde und für diese ausgelegt ist. CAML enthält Elemente zur Datendefinition und zur Abfrage und Anzeige von Daten in SharePoint-Portalen. Ist aufgrund der hohen Bedeutung für SharePoint-Projekte nach wie vor nicht aus dem Projektalltag in diesem Bereich wegzudenken."}, {"radar": "microsoft", "quadrant": 2, "ring": "einsetzen", "name": "Continuous integration (CI)", "kommentare": null, "desc": "Wenn viele Entwickler an komplexen Softwareprojekten zusammenarbeiten, kann das Integrieren unterschiedlicher Teile von Code ein langer und schwer einschätzbarer Prozess sein. Sie können jedoch die Effizienz und Zuverlässigkeit dieses Prozesses erhöhen, wenn Sie das Projekt fortlaufend erstellen und bereitstellen. Fortlaufende Integration (CI) ist das Verfahren, den Code so häufig wie möglich in ein freigegebenes Repository zu integrieren. Während der Codeintegration kann Sie eine Buildunterbrechung oder ein Testfehler rechtzeitig über einen Fehler im Code informieren."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "Balsamiq_ms", "kommentare": null, "desc": "Wireframe-/Mockup-Werkzeug. Hilfreich in Angebots- und Entwicklungskontexten mit hohem Anteil an Prototypisierung und Formulargestaltung."}, {"radar": "microsoft", "quadrant": 4, "ring": "einsetzen", "name": "datatables.net", "kommentare": null, "desc": "JavaScript-Framework zur flexiblen erzeugung hochperformanter Tabellen. Erprobt und relevant in Projekten mit clientseitigen Implementierungen von tabellarischer Darstellung strukturierter Daten."}, {"radar": "microsoft", "quadrant": 4, "ring": "einsetzen", "name": "Microsoft Graph", "kommentare": null, "desc": "Microsoft Graph stellt mehrere APIs aus Office 365 und anderen Microsoft-Clouddiensten über einen einzelnen Endpunkt (https://graph.microsoft.com) zur Verfügung. Microsoft Graph vereinfacht Abfragen über mehrere Cloudsysteme hinweg, die andernfalls komplexer ausfallen würden.  Wird von Microsoft als neue Workflow- und Datenkonsolidierungsplattform für Cloudanwendungen proklamiert - derzeit noch wenig Erfahrung. Insgesamt aber durchaus interessant und relevant für Projekte mit Cloudfokus und hohem Aufkommen an Datenverkehr zwischen verschiedenen Anwendungen."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "ASP.NET Web API", "kommentare": null, "desc": "ASP.NET Web API ist eine Framework um HTTP Services für eine große Palette an Clients wie Browser oder Mobilgeräte bereitzustellen. Web API ist die preferierte platform um RESTful applications mit dem .NET Framework zu implementieren."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "Azure Web und Mobile", "kommentare": null, "desc": "Stellt skalierbare Backends, APIs und Logikbausteine zur mobilen Nutzung von Daten (auch über mehrere Cloudanbieter) bereit, inkl. Media Services (Verschlüsselung von Audio- und Videodaten), Search-as-a-Service, Notification und Nutzerbindung/-Analyse. Relevant für große und/oder cloudbasierte mobile Projekte im Microsoft Stack."}, {"radar": "microsoft", "quadrant": 4, "ring": "einsetzen", "name": "knockout.js", "kommentare": null, "desc": "Knockout.js – oft einfach als Knockout bezeichnet – ist eine JavaScript-Bibliothek zur Umsetzung des Model-View-ViewModel-Musters im Rahmen eines Webclients. Es dient zur losen Kopplung zwischen der Darstellung (HTML-View) und den Nutzdaten (JavaScript-Objekte) durch einen Datenbindungsmechanismus. In kleinen bis mittleren Projekten mit Fokus auf clientseitige Implementierung relevant und mehrfach erprobt."}, {"radar": "microsoft", "quadrant": 4, "ring": "einsetzen", "name": "LINQ", "kommentare": null, "desc": "LINQ (Abkürzung für Language Integrated Query) ist ein programmtechnisches Verfahren von Microsoft zum Zugriff auf Daten. Es kapselt tiefer im Stack liegende Methoden zum Zugriff auf Daten anhand einer Programmiernotation auf Basis von Method Chaining oder wahlweise auf Basis einer Notation, die an SQL angelehnt ist. Relevant für alle Projekte mit Fokus auf serverseitiger oder Desktop-Programmierung auf Basis des Microsoft .NET Frameworks."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "WebCompiler", "kommentare": null, "desc": "Visual Studio Extension zur Kompilierung von LESS, Sass, JSX, ES6 und CoffeScript. Relevant für alle Projekte mit Fokus auf Webanwendungen durch die gute Integration in Visual Studio."}, {"radar": "microsoft", "quadrant": 4, "ring": "einsetzen", "name": "ASPX", "kommentare": null, "desc": "ASP.NET (Active Server Pages .NET) ist ein Web Application Framework von Microsoft, mit dem sich dynamische Webseiten, Webanwendungen und Webservices entwickeln lassen. Parallel gibt es seit 2015 ASP.NET Core, ein quelloffenes separates Framework, das offiziell auch Linux und Mac OS X unterstützt. Aufgrund der noch immer hohen Relevanz (insbesondere im SharePoint/CRM Kontext) ist ASPX nicht aus dem Projektalltag des Microsoft-Beraters wegzudenken."}, {"radar": "microsoft", "quadrant": 1, "ring": "überdenken", "name": "Windows 10 Mobile", "kommentare": null, "desc": "Mobil-Variante von Windows 10. Nicht projektrelevant aufgrund verschwindend geringer Marktdurchdringung."}, {"radar": "microsoft", "quadrant": 2, "ring": "einsetzen", "name": "Domain Driven Design (DDD)", "kommentare": null, "desc": "Domain Driven Design (DDD) ist eine Herangehensweise für die Modellierung komplexer objektorientierter Softwaresysteme, in der maßgeblich die Architektur von der umzusetzende Fachlichkeit der Anwendungsdomäne beeinflusst wird."}, {"radar": "microsoft", "quadrant": 3, "ring": "überdenken", "name": "InfoPath", "kommentare": null, "desc": "Formularengine für SharePoint. Abgekündigt aber immer noch in diversen Kontexten im Einsatz, z.B. ist das Document Information Panel in allen aktuellen Office Produkten ein natives InfoPath Formular - mit allen Altlasten, Bugs und Einschränkungen."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "LINQPad", "kommentare": null, "desc": "LINQPad ist eine Entwicklungsumgebung für Microsoft .NET. Mit dem Werkzeug können interaktiv Datenbanken per SQL oder LINQ abgefragt werden (neben anderen Quellen wie OData oder WCF Data Services). Hilfreich für schnelle Tests von programmatischen Datenbankabfragen."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "Visual Studio Code", "kommentare": "Architektenzirkel 11/2018", "desc": "Visual Studio Code, kurz auch VS Code, ist ein kostenloser, quelloffener und plattformübergreifender Quelltext-Editor von Microsoft. Er dient vorrangig der Entwicklung von Webanwendungen und ermöglicht die Programmierung mit den Programmier- und Auszeichnungssprachen Batch, C#, C++, Clojure, CoffeeScript, CSS, Dockerfile, F#, Go, Groovy, Handlebars.js, HTML, Ini, Jade, Java, JavaScript, JSON, Less, Lua, Makefile, Markdown, Objective-C, Perl, PowerShell, PHP, Python, R, Razor, Ruby, Rust, Sass, SQL, Swift, TypeScript, Visual Basic und XML. Im Unterschied zu Visual Studio arbeitet VS Code nicht mit Projektdateien, sondern auf Basis von Codedateien und Ordnern. Relevant für kleinere bis mittlere Entwicklungsarbeiten in entsprechenden Sprachen/Frameworks/Technologien."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "Nintex Workflows", "kommentare": null, "desc": "Workflowengine für SharePoint. Hohe Relevanz für kleine bis mittlere SharePoint-Projekte, sowohl on-premise als auch in der Cloud."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "VMWare", "kommentare": null, "desc": "Virtualisierungsplattform, ähnlich zu Hyper-V. Hohe Verbreitung und daher hohe Relevanz in allen virtualisierten Umgebungen."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "Azure Storage", "kommentare": null, "desc": "Dauerhafter, hoch verfügbarer und skalierbarer Cloudspeicher inkl. Backup/Restore und Katastrophenabsicherung. Relevant für große und/oder cloudbasierte (Outsourcing-)Projekte im Microsoft Stack."}, {"radar": "microsoft", "quadrant": 4, "ring": "einsetzen", "name": "Rx", "kommentare": null, "desc": "Die Reactive Extensions (kurz: Rx) sind eine Erweiterung von LINQ, welche auf IObservable<T> statt IEnumerable<T> arbeitet. Es handelt sich dabei um eine Implementierung des Beobachter-Entwurfsmusters. Als Teil des Gang-of-Four Kataloges zu Entwurfsmuster auch heute noch relevant für serverseitige oder Fat-Client-Entwicklung."}, {"radar": "microsoft", "quadrant": 1, "ring": "evaluieren", "name": "Azure Service Fabric", "kommentare": null, "desc": "Azure Service Fabric stellt eine vollständige Infrastruktur zur Entwicklung microservicebasierter Anwendungen zur Verfügung. Die Microservices können in Azure, in anderen Clouds oder lokal ausgeführt werden."}, {"radar": "microsoft", "quadrant": 4, "ring": "evaluieren", "name": "Entity Framework Core", "kommentare": null, "desc": "Entity Framework Core, kurz auch EF Core, ist ein Framework für objektrelationale Abbildung (ORM) auf Basis von .NET Core. Es ist eine Neuimplementierung von EF und hat im aktuellen Ausbaustadium nicht den gleichen Funktionsumfang wie EF und verfolgt leicht andere Konzepte."}, {"radar": "microsoft", "quadrant": 4, "ring": "evaluieren", "name": "R Server", "kommentare": null, "desc": "Microsoft R Server ist eine Cloud- oder On-Premise-Lösung für die Datenanalyse in großem Maßstab und die Erstellung intelligenter Apps auf Basis dieser Daten. Er ist für die Verarbeitung großer Datenmengen sowie die Durchführung von Berechnungen auf Hunderten von Knoten ausgelegt und ermöglicht so die Skalierung von R-Analysen. Das Einsatzgebiet ist relativ speziell, für Big Data Projekte im Microsoft Stack definitiv relevant."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "Azure Compute Services", "kommentare": null, "desc": "Stellt Dienste und virtuelle Maschinen zur Auslagerung aufwendiger Berechnungen in die Cloud bereit. Relevant für große und/oder cloudbasierte (Outsourcing-)Projekte im Microsoft Stack."}, {"radar": "microsoft", "quadrant": 1, "ring": "überdenken", "name": "Yammer", "kommentare": null, "desc": "Yammer ist ein soziales Netzwerk, das ursprünglich als Mikrobloggingdienst gestartet wurde. Das Angebot richtet sich nicht an Einzelpersonen, sondern an Unternehmen; es können interne Netzwerke (nur E-Mail-Adressen mit der gleichen Domain sind erlaubt) und externe Netzwerke eingerichtet werden. Mit der Integration des Office Graph und den angeschlossenen, hauseigenen social collaboration Werkzeugen O365 Groups, Skype Groups, Microsoft Teams etc. könnte Yammer als Zielplattform deutlich an Relevanz verlieren - Einsatz eher zurückhaltend."}, {"radar": "microsoft", "quadrant": 4, "ring": "überdenken", "name": "jQuery UI", "kommentare": null, "desc": "jQuery UI ist eine Erweiterung der freien JavaScript-Bibliothek jQuery und bietet Lösungen zur Gestaltung und Widgets an. jQuery UI ist mittlerweile allerdings nicht mehr zeitgemäß - das Look&Feel wirkt veraltet, es wird kein Responsive Web Design berücksicht und auch die Widgets/Komponeten entsprechen nicht mehr dem aktuellen Stand."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "Azure Network services", "kommentare": null, "desc": "Stellt Dienste zur Realisierung cloudbasierter Netzwerkinfrastrukturen bereit, z.B. VPN, CDN, DNS, etc. Relevant für große und/oder cloudbasierte (Outsourcing-)Projekte im Microsoft Stack."}, {"radar": "microsoft", "quadrant": 4, "ring": "evaluieren", "name": ".Net Core", "kommentare": null, "desc": ".NET Core ist im Gegensatz zum nur unter Windows verwendbaren .NET Framework zwecks Portabilität als plattformunabhängiges Framework entworfen worden und ist damit nicht nur für Windows, sondern auch für die Betriebssysteme Linux und OS X einsetzbar. Als Open Source-Projekt wird .NET Core über GitHub verfügbar gemacht. Es ist speziell für Server Anwendungen gedacht. .NET Core wird parallel zum monolithischen .NET Framework weiterentwickelt. In Kombination mit iOS, Android und Xamarin kann sich hier eine hohe Relevanz für Kundenprojekte entwickeln."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "Azure AD B2C", "kommentare": null, "desc": "Azure AD B2C ist ein cloudbasierter Identitätsdienst für Endbenutzer zur Integration in eigene Anwendungen. Er bietet Self-Service Optionen, die Einbindung von Identitätsprovidern wie Facebook und erweiterte Optionen wie Multifaktor Authentifizierung."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "Azure DevOps", "kommentare": null, "desc": "Bietet eine vollumfängliche Umgebung für die Softwareentwicklung von Versionskontrolle über Anforderungs- und Test-Management bis hin zum automatisierten Build- und Release-Management. Durch den Betrieb in der Cloud werden neue Features laufend hinzugefügt."}, {"radar": "microsoft", "quadrant": 4, "ring": "überdenken", "name": "ADO.Net", "desc": "ADO.NET ist ein Teil der von Microsoft entwickelten .NET-Plattform. Es handelt sich um eine Sammlung von Klassen, die den Zugriff auf relationale Datenbanken gewährleisten. Veralteter, aber immer noch unterstützter Zugriffsmodus aus .NET Projekten auf SQL Datenbanken."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "Nintex Forms", "kommentare": null, "desc": "Formularengine für SharePoint. Hohe Relevanz für kleine bis mittlere SharePoint-Projekte, sowohl on-premise als auch in der Cloud."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "Azure DevOps Server (ehem. Team Foundation Server)", "kommentare": null, "desc": "Bietet eine vollumfängliche Umgebung für die Softwareentwicklung von Versionskontrolle über Anforderungs- und Test-Management bis hin zum automatisierten Build- und Release-Management. Wir empfehlen, so viele Komponenten des TFS im Projekt zu nutzen wie es die Projekt-Rahmenparameter zulassen."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "UWP", "kommentare": null, "desc": "Universal Windows Platform (Deutsch etwa: Universelle Windows-Plattform), kurz auch UWP, ist der Name einer Laufzeitumgebung für Anwendungen, die unter Windows 10 ausgeführt werden können. Die UWP stellt eine Weiterentwicklung der mit Windows 8 eingeführten Windows Runtime dar. Basierend auf der UWP ist es möglich, eine Anwendung mit ein- und derselben Codebasis für unterschiedliche Klassen von Zielgeräten zu entwickeln, bei denen es sich unter anderen um Desktop-Computer, Mobilgeräte, Xbox-Geräte und IoT-Geräte wie etwa Raspberry Pi handeln kann, und im Windows Store bereitzustellen. Relevant für Projekte, die mehrere Endgeräte mit UWP-Unterstützung bedienen müssen und/oder Endkundenvermarktung von Anwendungen als Anforderung haben."}, {"radar": "microsoft", "quadrant": 4, "ring": "einsetzen", "name": "Mono for Xamarin", "kommentare": null, "desc": "Xamarin brings .NET to iOS and Android, reusing skills and code while getting access to the native APIs and performance. Mono is an open source .NET implementation that was created before Xamarin and Microsoft joined together. Mono will support the .NET Standard as another .NET runtime that is open source and flexible. Relevant für Projekte mit Fokus auf der Unterstützung mehrerer mobiler Plattformen (iOS, Android, Windows) und plattformunabhängiger Entwicklung."}, {"radar": "microsoft", "quadrant": 2, "ring": "einsetzen", "name": "FastTrack", "kommentare": null, "desc": null}, {"radar": "microsoft", "quadrant": 2, "ring": "einsetzen", "name": "Scrum", "kommentare": null, "desc": "//TODO"}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "MS Build", "kommentare": null, "desc": "MSBuild, auch als Microsoft Build Engine bezeichnet, ist ein von Microsoft entwickeltes, kostenloses Build-Tool, d. h. ein Software-Werkzeug für das Erstellen vom .NET-basierten Anwendungen. Microsofts integrierte Entwicklungsumgebung Visual Studio ist in wesentlichem Maße von MSBuild abhängig; MSBuild selbst ist aber nicht von Visual Studio abhängig. Dadurch lassen sich mit MSBuild auch Visual-Studio-Projekte ohne den Einsatz von Visual Studio bauen. Defacto-Standard in serverseitigen oder Desktop-Entwicklungsprojekten im Microsoft Stack."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "Dynamics 365 Operations and Financial", "kommentare": null, "desc": "Microsoft Dynamics NAV ist eine Standardsoftware für ERP-Systeme. Relevant für kleine bis mittlere ERP-Projekt im Microsoft Stack."}, {"radar": "microsoft", "quadrant": 2, "ring": "einsetzen", "name": "Agile Planungsmethoden (KanBan)", "kommentare": null, "desc": "//TODO"}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "HyperV", "kommentare": null, "desc": "Microsoft Hyper-V, codenamed Viridian and formerly known as Windows Server Virtualization, is a native hypervisor; it can create virtual machines on x86-64 systems running Windows. Starting with Windows 8, Hyper-V supersedes Windows Virtual PC as the hardware virtualization component of the client editions of Windows NT. A server computer running Hyper-V can be configured to expose individual virtual machines to one or more networks. Alternative zu VMWare von Microsoft und daher vornehmlich im MS-Server-Stack relevant."}, {"radar": "microsoft", "quadrant": 4, "ring": "einsetzen", "name": "d3.js", "kommentare": null, "desc": "Das JavaScript-Framework \"Data-Driven Documents\" bietet umfangreiche Darstellungsoptionen für Diagramme und Datenvisualisierung. Relevant in Projekten mit entsprechendem Fokus auf die Darstellung von großen, komplexen oder mehrdimensionalen Daten."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "Azure AD", "kommentare": null, "desc": "Azure AD (nach Microsoft): Azure Active Directory (Azure AD) ist ein cloudbasierte Verzeichnis- und Identitätsverwaltungsdienst. Azure AD kombiniert grundlegende Verwaltungsdienste mit Identitätsgovernance und Zugriffsverwaltung für Anwendungen. Azure AD bietet außerdem eine umfassende, auf Standards basierende Plattform, mit der Entwickler ihre Anwendungen mit einer Zugriffssteuerung ausstatten können, die auf zentralisierten Richtlinien und Regeln basiert."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "Azure Datenbanken", "kommentare": null, "desc": "Stellt SQL-/NoSql-Datenbankumgebungen als DaaS-Lösung (Database-as-a-Service) bereit, inkl. Warehouse, Caching, DataFactory und hybrider Lösungen zur Kombination mit On-Premise-Datenbankumgebungen. Relevant für große und/oder cloudbasierte (Outsourcing-)Projekte im Microsoft Stack."}, {"radar": "microsoft", "quadrant": 4, "ring": "überdenken", "name": "LINQ2SQL", "kommentare": null, "desc": "Schlankes Framework für den Zugriff auf relationale Datenbank aus .NET Code heraus. Nicht mehr zeitgemäß, aber für kleine Projekte (bzw. kleine Datenbanken) aufgrund seines extrem kleinen Overheads durchaus noch produktiv einsetzbar."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "IIS", "kommentare": null, "desc": "Internet Information Services (IIS) (vormals Internet Information Server) ist eine Webdienst- und Webanwendungsplattform von Microsoft für PCs und Server. Standardprodukt für alle netzwerkbasierten Dienste und Anwendungen im Microsoft Stack und kommt dementsprechend häufig in Projekten mit Microsoft Technologien als Basis zum Einsatz."}, {"radar": "microsoft", "quadrant": 4, "ring": "einsetzen", "name": "C#", "kommentare": null, "desc": "C# ist eine typsichere, objektorientierte Allzweck-Programmiersprache. Die Sprache ist an sich plattformunabhängig, wurde aber im Rahmen der .NET-Strategie entwickelt, ist auf diese optimiert und ist meist in deren Kontext zu finden. Microsoft bezeichnet seine Implementierung als Visual C#. Historisch wurde in C# fast exklusiv für Microsoft Windows entwickelt. Durch Xamarin ist es aber auch möglich für OS X, iOS und Android zu entwickeln. Zudem unterstützt ASP.NET seit Version 5 auch GNU/Linux und OS X. Die aktuelle Version 6 wurde als Teil von .NET 2015 veröffentlicht und ist allein durch Microsoft spezifiziert. Bis Version 2 war die Sprache bei der ECMA und der ISO als Standard registriert. De-facto Standardsprache für alle Projekte mit Entwicklungsanteil im Microsoft Stack und/oder einer der unterstützten Zielplattformen."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "NuGet", "kommentare": null, "desc": "//TODO: Überarbeiten: NuGet ist eine freie Open-Source-Paketverwaltung für die Softwareentwicklung unter .NET. Hilfreich (vor allem als Visual Studio Extension) in Projekten mit großen Anteilen von OpenSource-Komponenten. NuGet ist eine freie Open-Source-Paketverwaltung bzw. ein Ökosystem für Softwarewerkzeuge und Softwaredienste für die Softwareentwicklung unter .NET. NuGet wird als Visual-Studio-Erweiterung ausgeliefert und wird auch von MonoDevelop, SharpDevelop und LINQPad verwendet. NuGet kann von der Powershell-Kommandozeile angesprochen und mit Powershell-Skripts automatisiert werden. Relevant für alle Entwicklungsprojekte im Microsoft Stack, die freie Drittherstellerkomponenten integrieren."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "Postman / DHC REST Client", "kommentare": null, "desc": "WebRequest-Generator für das Debugging von POST- und GET-Requests. Als Browser-Erweiterung für Chrome und Firefox verfügbar. Hohe Relevanz für alle web- und serviceorientierten Projekte, in denen programmatisch WebRequests an entsprechende APIs (z.B. SharePoint REST) zum Einsatz kommen."}, {"radar": "microsoft", "quadrant": 2, "ring": "einsetzen", "name": "CMMI", "kommentare": null, "desc": "//TODO"}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "Power BI", "kommentare": null, "desc": "Power BI ist eine Zusammenstellung von Tools zum Analysieren und Bereitstellen von Geschäftsdaten"}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "Sysinternals Tools", "kommentare": null, "desc": "Windows-Tools zur Analyse von Hintergrundprozessen (ähnlich zum TaskManager), vom Laufzeitverhalten von Anwendungen (ähnlich zum Performance Monitor), von automatisch beim Hochfahren gestarteten Anwendungen (ähnlich msconfig), dem Starten von Anwendungen unter anderem Benutzerkontext und vielen weiteren, häufigen Anwendungsfällen aus dem Alltag eines Windows-Andwenders/Administrators. Unverzichtbar für alle Windows-DEV-VMs."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "NUnit", "kommentare": null, "desc": "NUnit ist ein Software-Framework, mit dem sich Unit-Tests für alle .NET-Sprachen durchführen lassen. NUnit ist, wie der Großteil der Unit-Testing-Frameworks, eine Umsetzung des xUnit-Konzepts und wurde ursprünglich von JUnit portiert. Für die Entwicklungsumgebung Visual Studio von Microsoft existieren die Plug-ins Visual NUnit (nutzbar für Visual Studio 2008 und 2010), NUnit Test Adapter (nutzbar ab Visual-Studio-Version 2012), VSNunit sowie das kommerzielle Projekt TestDriven.NET. Hohe Verbreitung durch die gute Integration in Visual Studio."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "Dynamics 365", "kommentare": null, "desc": "Dynamics 365 (zuvor Dynamics CRM) stellt eine leistungsstarke Geschäftsanwendungsplattform bereit, die Kunden, Microsoft-Partnern und unabhängigen Softwareherstellern (ISVs) eine Möglichkeit bietet, hochwertige Lösungen bereitzustellen und zu erweitern. Diese Lösungen bauen auf den zuverlässigen Funktionen der Kernplattform von Dynamics 365 auf. Relevant für Projekte mit hohem Anteil an Verwaltungs- und Datenhaltungsaufkommen im Bereich Endkunden- und Partnermanagement."}, {"radar": "microsoft", "quadrant": 1, "ring": "evaluieren", "name": "Azure Functions", "kommentare": null, "desc": "Azure Functions ermöglicht ähnlich wie AWS Lambda  eine serverlose Architektur.  Der Dienst skaliert automatisch je nach Auslastung."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "Microsoft Flow", "kommentare": null, "desc": "Microsoft Flow ist eine cloudbasierte Workflowplattform für Endanwender (\"Power User\") für den Zugriff auf diverse Cloud-Dienste verschiedener Hersteller - ähnlich IFTTT. Geringe Relevanz für Projekte mit Entwicklungsfokus aufgrund der Zielgruppenausrichtung \"Endanwender\" bzw. \"Power User\"."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "BizTalk", "kommentare": null, "desc": "BizTalk Server ist ein Enterprise Service Bus. Durch Adapter, die speziell darauf ausgelegt sind, in großen Unternehmen zwischen Systemen zu kommunizieren, wird eine Automatisierung von Geschäftsprozessen ermöglicht. Auf Anwender bezogene Prozesse können nicht direkt mit BizTalk implementiert werden - dafür ist Microsoft SharePoint vorgesehen. Relevant für Projekte mit komplexer Systemlandschaft und hohem Server-to-Server Kommunikations- und Automatisierungsbedarf, unabhängig vom Technologiestack."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "Terraform (von HashiCorp)", "kommentare": null, "desc": null}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "iOS", "kommentare": null, "desc": "iOS ist ein von Apple entwickeltes mobiles Betriebssystem für das iPhone, das iPad, das iPad mini und den iPod touch. Es wird nur auf eigener Hardware von Apple eingesetzt. iOS basiert auf einem macOS-Kern (unter dem ursprünglichen Namen „Mac OS X“ seit 1998 entwickelt, 2012 in „OS X“ und 2016 in „macOS“ umbenannt) und damit auf dem Darwin-Betriebssystem. Durch die hohe Verbreitung entsprechender Geräte und die häufige Nachfrage als Zielplattform für Kundenprojekte hat iOS eine nicht zu unterschätzende Relevanz im adesso Projektalltag entwickelt."}, {"radar": "microsoft", "quadrant": 4, "ring": "einsetzen", "name": "jQuery", "kommentare": null, "desc": "jQuery (auch: jQuery Core) ist eine freie JavaScript-Bibliothek, die Funktionen zur DOM-Navigation und -Manipulation zur Verfügung stellt. Trotz starker Tendenzen zu 'Vanilla JS' (vgl. http://youmightnotneedjquery.com/) und diversen anderen Entwicklungsmodellen/Frameworks ist jQuery in kleinen bis mittleren Projekten mit clientseitiger Implementierung nach wie vor relevant."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "BrowserStack", "kommentare": null, "desc": "BrowserStack is a cloud-based cross-browser testing tool that enables developers to test their websites across various browsers on different operating systems and mobile devices, without requiring users to install virtual machines, devices or emulators. Hilfreich in Projekten, in denen eine clientseitige Entwicklungsarbeit von vielen verschiedenen Browserversionen und Betriebssystemen unterstützt werden muss."}, {"radar": "microsoft", "quadrant": 4, "ring": "überdenken", "name": "Kendo UI", "kommentare": null, "desc": "Auf jQuery oder Angular aufbauendes UI-Framework von Telerik. Wird in der JavaScript-Szene als nicht mehr zeitgemäß angesehen, da der DOM hier auf relativ klassische Art und Weise manipuliert wird. Modernere Frameworks wie reactJs sind mittlerweilse zu bevorzugen."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "SQL Server", "kommentare": null, "desc": "Der SQL Server ist ein relationales Datenbankmanagementsystem, das sich am Standard der aktuellen SQL-Version orientiert. Standardprodukt für alle Datenverarbeitungsprojekte im Microsoft Stack. Hohe Relevanz durch große Nutzerbasis und langjähre Projekterfahrung."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "WebEssentials", "kommentare": null, "desc": "Ähnlich zum WebCompiler; kompiliert/minifiziert CSS/LESS, JS, TypeScript, CoffeeScript und bietet weitere Tools für WebDeveloper. Relevant für alle Projekte mit Fokus auf Webanwendungen durch die gute Integration in Visual Studio."}, {"radar": "microsoft", "quadrant": 4, "ring": "einsetzen", "name": "SignalR", "kommentare": null, "desc": "ASP.NET SignalR is a library for ASP.NET developers to add real-time web functionality to their applications. Real-time web functionality is the ability to have server-side code push content to the connected clients as it happens, in real-time.  Bevorzugte Alternative zu Polling etc."}, {"radar": "microsoft", "quadrant": 2, "ring": "einsetzen", "name": "DevOps und Anwendungslebenszyklus-Verwaltung", "kommentare": null, "desc": "//TODO"}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "PowerShell", "kommentare": null, "desc": "PowerShell ist ein plattformübergreifendes Framework von Microsoft zur Automatisierung, Konfiguration und Verwaltung von Systemen, bestehend aus einem Kommandozeileninterpreter, sowie einer Skriptsprache. Es basiert auf der Common Language Runtime (CLR) des .NET Framework und wird mit Windows als Teil des Windows Management Framework (WMF) unter einer proprietären Lizenz ausgeliefert. Seit 2016 gibt es auch die Windows PowerShell als Core Edition, welche wie PowerShell Core auf .NET Core basiert und als Teil von Windows Nano Server und Windows IoT ausgeliefert wird. Relevant für alle Projekte mit Automatisierungsbedarf, z.B. bei Administration oder Deployments. Unverzichtbar bei SharePoint Projekten."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "PowerApps", "kommentare": null, "desc": "Power Apps ist eine cloudbasierte Plattform zur Erstellung von simplen Apps für diverse Zielplattformen mit der Ausrichtung auf Endanwender bzw. \"Power User\".  Die Apps werden nach einer Vorkonfiguration auf Basis von Listen und logischen Bearbeitungsabfolgen automatisch gepackt und stehen nahezu ohne Verzögerung auf den Endgeräten zur Verfügung. Geringe bis mittlere Relevanz für Projekte mit Entwicklungsfokus aufgrund der Zielgruppenausrichtung \"Endanwender\" bzw. \"Power User\". Ggf. sinnvoll als schnelles Prototyping-Werkzeug oder in trivialen Kontexten mit Anforderung einer mobilen Formularbearbeitung."}, {"radar": "microsoft", "quadrant": 4, "ring": "einsetzen", "name": "Entity Framework", "kommentare": null, "desc": "Entity Framework, kurz auch EF, ist ein Framework für objektrelationale Abbildung (ORM). Es wurde von Microsoft entwickelt und dient dem ORM auf .NET-Objektstrukturen. Seit der Version 6.0, die 2013 erschien, gehört das Framework nicht mehr zum .NET Framework. Einhergehend mit .NET Core gibt es seit 2016 das separate Framework Entity Framework Core, das auch EF Core genannt wird. Leistungsfähiger OR-Mapper, für mittlere bis große .NET-Projekte geeignet."}, {"radar": "microsoft", "quadrant": 4, "ring": "einsetzen", "name": "bootstrap", "kommentare": null, "desc": "Bootstrap ist ein freies CSS-Framework. Es enthält auf HTML und CSS basierende Gestaltungsvorlagen für Typografie, Formulare, Buttons, Tabellen, Grid-Systeme, Navigations- und andere Oberflächengestaltungselemente sowie zusätzliche, optionale JavaScript-Erweiterungen. Ist für clientseitige Implementierungen im Microsoft-Stack relevant."}, {"radar": "microsoft", "quadrant": 2, "ring": "überdenken", "name": "Microsoft Solutions Framework (MSF)", "kommentare": null, "desc": "//TODO"}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "Azure", "kommentare": null, "desc": "Microsoft Azure gewinnt immer mehr Relevanz durch die Zunahme von Cloud-basierten Projekten, definitive Einsatzempfehlung."}, {"radar": "microsoft", "quadrant": 4, "ring": "einsetzen", "name": "ASP.NET", "kommentare": null, "desc": "ASP.NET (Active Server Pages .NET) ist ein Web Application Framework von Microsoft, mit dem sich dynamische Webseiten, Webanwendungen und Webservices entwickeln lassen. ASP.NET ist Teil des .NET Frameworks. Parallel gibt es seit 2015 ASP.NET Core, ein quelloffenes separates Framework, das offiziell auch Linux und Mac OS X unterstützt. Aktuell noch das Standard-Framework für Webanwendungen mit serverseitigem Entwicklungsfokus im Microsoft Stack. Je nach Anwendungsfall erwarten wir jedoch die Ablösung durch ASP.NET Core."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "Azure Kubernetes Service (AKS)", "kommentare": null, "desc": null}, {"radar": "microsoft", "quadrant": 3, "ring": "überdenken", "name": "Browserify", "kommentare": null, "desc": "Browserify is an open-source JavaScript tool that allows developers to write Node.js-style modules that compile for use in the browser. Relevant für entsprechend Node.js basierte Projekte. Relativ selten im MS-Stack im Einsatz, daher herabgestuft."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "K2 Black Pearl", "kommentare": null, "desc": "Extrem mächtige Business Process Management / Workflow Plattform. Kann in Verbindung mit SharePoint eingesetzt werden und hat in entsprechend Workflow-getriebenen Projekten als Alternative zu Nintex Workflows eine hohe Relevanz."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "ILSpy", "kommentare": null, "desc": "ILSpy ist ein Klassenbrowser für Microsoft .NET mit eingebautem Decompiler. Er kann mit Hilfe des Disassemblers die Methoden im Rahmen der Möglichkeiten in einen lesbaren Code (Quellcode) zurückübersetzt werden. Bei der Zielsprache der Dekompilierung kann zwischen IL, C# und Visual Basic .NET ausgewählt werden. Extrem hilfreich für undokumentierte APIs oder zum Verständnis der internen Verhaltensweise von Drittherstellerkomponenten."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "Microsoft 365", "kommentare": null, "desc": null}, {"radar": "microsoft", "quadrant": 1, "ring": "überdenken", "name": "Windows Phone 8", "kommentare": null, "desc": "Vorgänger zu Windows 10 Mobile. Nicht projektrelevant aufgrund verschwindend geringer Marktdurchdringung."}, {"radar": "microsoft", "quadrant": 4, "ring": "evaluieren", "name": "F#", "kommentare": null, "desc": "F# ist eine funktionale Programmiersprache von Microsoft für das .NET-Framework. Neben den Bestandteilen der funktionalen Programmierung sind in F# objektorientierte sowie imperative Sprachkonstrukte enthalten. Mäßige Verbreitung in adesso Projekten auf Basis von .NET, je nach Kontext für Microsoft Fakes relevant."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "Fiddler", "kommentare": null, "desc": "HTTP-Request Inspector. Extrem hilfreich für das Debugging von netzbasierten Diensten, insbesondere falls dahinterliegende Hops Fehler produzieren, die vom angesprochenen Dienst nicht ausreichend kommuniziert werden."}, {"radar": "microsoft", "quadrant": 4, "ring": "einsetzen", "name": "less", "kommentare": null, "desc": "Less ist eine Stylesheet-Sprache mit dem Ziel, das Schreiben von CSS effizienter zu gestalten. Hauptziele sind dabei, intelligente Steuerungen zu ermöglichen sowie Code-Wiederholungen zu vermeiden. Less ist eine Obermenge von CSS, das heißt, ein CSS-Code ist gleichzeitig auch gültiger Less-Code. Less wird zu CSS kompiliert. Hilft in der Organisation und Strukturierung von CSS-Code in mittleren bis großen webbasierten Projekten."}, {"radar": "microsoft", "quadrant": 4, "ring": "einsetzen", "name": ".NET Framework", "kommentare": null, "desc": ".NET dient als Sammelbegriff für mehrere von Microsoft herausgegebene Software-Plattformen, die der Entwicklung und Ausführung von Anwendungsprogrammen dienen, Produkte, Frameworks, Programmiersprachen, und alles, was mit den genannten in Verbindung steht, etwa Werkzeuge und Technologien. Die Bedeutung der einzelnen Teile und Technologien, die .NET umfasst, hat sich im Laufe der Zeit gewandelt. Derzeit (Stand 2017) spielen folgende Frameworks (hier weitgehend identisch mit dem Begriff Plattformen verwendet) eine herausgehobene Rolle in der Praxis: das klassische .NET Framework, das ein monolithisches Framework darstellt, das neu erschienene Framework .NET Core, das modular aufgebaut ist sowie die Plattform Xamarin. De-facto Standardentwicklungsplattform für Projekte im Microsoft Stack."}, {"radar": "microsoft", "quadrant": 1, "ring": "einsetzen", "name": "SharePoint", "kommentare": null, "desc": "Microsoft SharePoint Server ist eine Business Plattform für teamübergreifende Zusammenarbeit, Content Management, Search, Workflows und Informationsmanagement. Wird umgangssprachlich auch als \"Betriebssystem des Intranets\" bezeichnet. Relevant für Projekte mit Bezug auf verteiltes Arbeiten mit Dokumenten und Listen, Multimediainhalten, Workflows und sonstigem Web Content - hauptsächlich im Microsoft Stack."}, {"radar": "microsoft", "quadrant": 3, "ring": "evaluieren", "name": "Microsoft Teams/Groups", "kommentare": null, "desc": "Office 365 Collaboration Plattform. Relevant für Office 365 basierte Projekte mit hohen Anteil an Collaboration, Chat, Sharing etc."}, {"radar": "microsoft", "quadrant": 3, "ring": "einsetzen", "name": "Git_ms", "kommentare": null, "desc": "Git ist eine freie Software zur verteilten Versionsverwaltung von Dateien. Kann in Verbindung mit TFS eingesetzt werden. Weit verbreitet und insbesondere in der OpenSource-Szene der quasi-Standard zur Quellcodeverwaltung."}]
